
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>用OpenCV制作一个低成本的立体相机 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-etoc/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-mermaid-gb3/mermaid/mermaid.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    


    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../古月居/古月居.html" />
    
    
    <link rel="prev" href="3D视觉工坊.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                        <b>1.1.</b>
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="3D视觉工坊.html">
            
                <a href="3D视觉工坊.html">
            
                    
                        <b>1.2.</b>
                    
                    3D视觉工坊
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="用OpenCV制作一个低成本的立体相机.html">
            
                <a href="用OpenCV制作一个低成本的立体相机.html">
            
                    
                        <b>1.2.1.</b>
                    
                    用OpenCV制作一个低成本的立体相机
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../古月居/古月居.html">
            
                <a href="../古月居/古月居.html">
            
                    
                        <b>1.3.</b>
                    
                    古月居
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" >
            
                <span>
            
                    
                        <b>1.3.1.</b>
                    
                    Vision
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" >
            
                <span>
            
                    
                        <b>1.3.1.1.</b>
                    
                    相机投影模型
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1.1" data-path="../古月居/Vision/相机投影模型/相机投影模型之量身高.html">
            
                <a href="../古月居/Vision/相机投影模型/相机投影模型之量身高.html">
            
                    
                        <b>1.3.1.1.1.</b>
                    
                    相机投影模型之量身高
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >用OpenCV制作一个低成本的立体相机</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7528;opencv&#x5236;&#x4F5C;&#x4E00;&#x4E2A;&#x4F4E;&#x6210;&#x672C;&#x7684;&#x7ACB;&#x4F53;&#x76F8;&#x673A;">&#x7528;OpenCV&#x5236;&#x4F5C;&#x4E00;&#x4E2A;&#x4F4E;&#x6210;&#x672C;&#x7684;&#x7ACB;&#x4F53;&#x76F8;&#x673A;</h1>
<p>AR/VR&#x7684;&#x5174;&#x8D77;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x4E0A;&#x4E86;3D&#x7535;&#x5F71;&#x548C;&#x89C6;&#x9891;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x4F60;&#x9700;&#x8981;&#x6234;&#x4E0A;&#x4E00;&#x526F;3D&#x773C;&#x955C;&#x624D;&#x80FD;&#x611F;&#x53D7;&#x5230;3D&#x6548;&#x679C;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF1F;&#x5F53;&#x5C4F;&#x5E55;&#x53EA;&#x662F;&#x5E73;&#x9762;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x4F53;&#x9A8C;3D&#x6548;&#x679C;&#xFF1F; &#x5176;&#x5B9E;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x53EB;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x7684;&#x73A9;&#x610F;&#x513F;&#x6765;&#x6355;&#x83B7;&#x7684;&#x3002;</p>
<p>&#x672C;&#x6587;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5B66;&#x4E60;&#x5982;&#x4F55;DIY&#x4E00;&#x4E2A;&#x4F4E;&#x6210;&#x672C;&#x7684;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#xFF08;<strong>&#x4F7F;&#x7528;&#x4E00;&#x5BF9;&#x7F51;&#x7EDC;&#x6444;&#x50CF;&#x5934;</strong>&#xFF09;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F7F;&#x7528;OpenCV&#x6355;&#x83B7;3D&#x89C6;&#x9891;&#x3002;</p>
<h4 id="&#x4E00;&#x3001;&#x5236;&#x4F5C;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x7684;&#x6B65;&#x9AA4;">&#x4E00;&#x3001;&#x5236;&#x4F5C;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x7684;&#x6B65;&#x9AA4;</h4>
<p>&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x5B89;&#x88C5;&#x901A;&#x5E38;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x6444;&#x50CF;&#x5934;&#xFF0C;&#x5B83;&#x4EEC;&#x4EE5;&#x56FA;&#x5B9A;&#x7684;&#x8DDD;&#x79BB;&#x9694;&#x5F00;&#x3002;&#x5DE5;&#x4E1A;&#x7EA7;&#x6807;&#x51C6;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x4F7F;&#x7528;&#x4E00;&#x5BF9;&#x76F8;&#x540C;&#x7684;&#x6444;&#x50CF;&#x5934;&#x3002;</p>
<p>&#x5982;&#x679C;&#x662F;&#x5728;&#x5BB6;&#x91CC;&#x9762;&#x5236;&#x4F5C;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5982;&#x4E0B;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF1A;</p>
<p>1.2&#x4E2A;USB&#x7F51;&#x7EDC;&#x6444;&#x50CF;&#x5934;&#xFF08;&#x76F8;&#x540C;&#x578B;&#x53F7;&#x7684;&#x4F18;&#x5148;&#xFF09;</p>
<p>2.&#x56FA;&#x5B9A;&#x76F8;&#x673A;&#x7684;&#x521A;&#x6027;&#x5E95;&#x5EA7;&#xFF08;&#x6728;&#x6750;&#xFF0C;&#x7EB8;&#x677F;&#xFF0C;PVC&#x6CE1;&#x6CAB;&#x677F;&#xFF09;</p>
<p>3.&#x5939;&#x94B3;&#x6216;&#x80F6;&#x5E26;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x53D1;&#x6325;&#xFF0C;&#x4F7F;&#x7528;&#x5176;&#x5B83;&#x4E0D;&#x540C;&#x7684;&#x7EC4;&#x4EF6;&#x5236;&#x4F5C;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x3002;&#x4F46;&#x57FA;&#x672C;&#x8981;&#x6C42;&#x662F;&#x4FDD;&#x6301;&#x6444;&#x50CF;&#x673A;&#x4E25;&#x683C;&#x56FA;&#x5B9A;&#x548C;&#x5E73;&#x884C;&#x3002;&#x56FA;&#x5B9A;&#x597D;&#x76F8;&#x673A;&#x5E76;&#x786E;&#x4FDD;&#x6B63;&#x786E;&#x5BF9;&#x9F50;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5B8C;&#x6210;&#x4E86;&#x5417;&#xFF1F; &#x6211;&#x4EEC;&#x51C6;&#x5907;&#x597D;&#x751F;&#x6210;&#x89C6;&#x5DEE;&#x56FE;&#x548C;3D&#x89C6;&#x9891;&#x4E86;&#x5417;&#xFF1F;</p>
<p>No, no, no!</p>
<h4 id="&#x4E8C;&#x3001;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x6807;&#x5B9A;&#x548C;&#x6821;&#x6B63;&#x7684;&#x91CD;&#x8981;&#x6027;">&#x4E8C;&#x3001;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x6807;&#x5B9A;&#x548C;&#x6821;&#x6B63;&#x7684;&#x91CD;&#x8981;&#x6027;</h4>
<p>&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x6807;&#x5B9A;&#x548C;&#x6821;&#x6B63;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x8BD5;&#x7740;&#x7528;&#x521A;DIY&#x597D;&#x7684;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x6355;&#x83B7;&#x5230;&#x7684;&#x56FE;&#x50CF;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x6807;&#x5B9A;&#x548C;&#x6821;&#x6B63;&#x8FC7;&#x7684;&#x89C6;&#x5DEE;&#x56FE;&#x3002;<img src="media/&#x7ACB;&#x4F53;&#x76F8;&#x673A;-1.png" alt=""></p>
<p>&#x5DE6;&#x56FE;&#x662F;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x6355;&#x83B7;&#x5230;&#x7684;&#x5DE6;&#x53F3;&#x56FE;&#x50CF;&#xFF1B;&#x53F3;&#x56FE;&#x662F;&#x7528;&#x6CA1;&#x6709;&#x6807;&#x5B9A;&#x8FC7;&#x7684;&#x5DE6;&#x53F3;&#x56FE;&#x50CF;&#x751F;&#x6210;&#x7684;&#x89C6;&#x5DEE;&#x56FE;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x5230;&#xFF0C;&#x4F7F;&#x7528;&#x672A;&#x6821;&#x51C6;&#x7684;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x751F;&#x6210;&#x7684;&#x89C6;&#x5DEE;&#x56FE;&#x975E;&#x5E38;&#x5608;&#x6742;&#x4E14;&#x4E0D;&#x51C6;&#x786E;&#x3002; &#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x8FD9;&#x6837;&#xFF1F;</p>
<p>&#x76F8;&#x5E94;&#x7684;&#x5173;&#x952E;&#x70B9;&#x5E94;&#x5177;&#x6709;&#x76F8;&#x7B49;&#x7684;Y&#x5750;&#x6807;&#xFF0C;&#x4EE5;&#x7B80;&#x5316;&#x70B9;&#x5BF9;&#x5E94;&#x641C;&#x7D22;&#x3002; &#x5728;&#x4E0B;&#x56FE;&#x4E2D;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x51E0;&#x4E2A;&#x5BF9;&#x5E94;&#x70B9;&#x4E4B;&#x95F4;&#x7ED8;&#x5236;&#x5339;&#x914D;&#x7EBF;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x5230;&#x8FD9;&#x4E9B;&#x7EBF;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x6C34;&#x5E73;&#x7684;&#xFF0C;&#x8FD8;&#x89C2;&#x5BDF;&#x5230;&#x5BF9;&#x5E94;&#x70B9;&#x7684;Y&#x5750;&#x6807;&#x4E5F;&#x4E0D;&#x76F8;&#x7B49;&#x3002;<img src="media/&#x7ACB;&#x4F53;&#x76F8;&#x673A;-2.png" alt=""></p>
<p>&#x4E0B;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x5BF9;&#x5177;&#x6709;&#x70B9;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x7684;&#x7ACB;&#x4F53;&#x56FE;&#x50CF;&#xFF0C;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x56FE;&#x50CF;&#x751F;&#x6210;&#x7684;&#x89C6;&#x5DEE;&#x56FE;&#x3002; &#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x5230;&#xFF0C;&#x4E0E;&#x524D;&#x4E00;&#x5F20;&#x76F8;&#x6BD4;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x89C6;&#x5DEE;&#x56FE;&#x566A;&#x58F0;&#x66F4;&#x4F4E;&#x3002; &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x5173;&#x952E;&#x70B9;&#x5177;&#x6709;&#x76F8;&#x7B49;&#x7684;Y&#x5750;&#x6807;&#x3002; &#x4EC5;&#x5F53;&#x76F8;&#x673A;&#x5E73;&#x884C;&#x65F6;&#x624D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002; &#x8FD9;&#x662F;&#x53CC;&#x89C6;&#x56FE;&#x51E0;&#x4F55;&#x7684;&#x7279;&#x4F8B;&#xFF0C;&#x5176;&#x4E2D;&#x56FE;&#x50CF;&#x662F;&#x5E73;&#x884C;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4EC5;&#x901A;&#x8FC7;&#x6C34;&#x5E73;&#x5E73;&#x79FB;&#x800C;&#x76F8;&#x5173;&#x3002; &#x8FD9;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x89C6;&#x5DEE;&#x56FE;&#x7684;&#x65B9;&#x6CD5;&#x4EC5;&#x641C;&#x7D22;&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x7684;&#x70B9;&#x5BF9;&#x5173;&#x7CFB;&#x3002;<img src="media/&#x7ACB;&#x4F53;&#x76F8;&#x673A;-3.png" alt=""></p>
<p>&#x592A;&#x68D2;&#x4E86;&#xFF01; &#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5BF9;&#x9F50;&#x6444;&#x50CF;&#x673A;&#x5E76;&#x4F7F;&#x5B83;&#x4EEC;&#x5B8C;&#x5168;&#x5E73;&#x884C;&#x3002; &#x90A3;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x4F1A;&#x6839;&#x636E;&#x53CD;&#x590D;&#x8BD5;&#x9A8C;&#x624B;&#x52A8;&#x8C03;&#x6574;&#x6444;&#x50CF;&#x673A;&#xFF1F; &#x597D;&#x5427;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x9879;&#x6709;&#x8DA3;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#xFF01; &#x5267;&#x900F;&#x8B66;&#x62A5;&#xFF01; &#x624B;&#x52A8;&#x8C03;&#x6574;&#x76F8;&#x673A;&#x9700;&#x8981;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x83B7;&#x5F97;&#x6E05;&#x6670;&#x7684;&#x89C6;&#x5DEE;&#x56FE;&#x3002; &#x6B64;&#x5916;&#xFF0C;&#x6BCF;&#x5F53;&#x8BBE;&#x7F6E;&#x53D7;&#x5230;&#x5E72;&#x6270;&#x4E14;&#x6444;&#x50CF;&#x673A;&#x79FB;&#x4F4D;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x5FC5;&#x987B;&#x91CD;&#x590D;&#x6B64;&#x8FC7;&#x7A0B;&#x3002; &#x8FD9;&#x5F88;&#x8017;&#x65F6;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x7406;&#x60F3;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4EE3;&#x66FF;&#x624B;&#x52A8;&#x8C03;&#x6574;&#x76F8;&#x673A;&#xFF0C;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x7528;&#x8F6F;&#x4EF6;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x201C;&#x7ACB;&#x4F53;&#x56FE;&#x50CF;&#x6821;&#x6B63;&#x201D;&#x7684;&#x65B9;&#x6CD5;&#x3002;[1] &#x4E0B;&#x56FE;&#x8BF4;&#x660E;&#x4E86;&#x7ACB;&#x4F53;&#x6821;&#x6B63;&#x7684;&#x8FC7;&#x7A0B;&#x3002; &#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x662F;&#x5728;&#x5E73;&#x884C;&#x4E8E;&#x900F;&#x8FC7;&#x5149;&#x5B66;&#x4E2D;&#x5FC3;&#x7684;&#x7EBF;&#x7684;&#x516C;&#x5171;&#x5E73;&#x9762;&#x4E0A;&#x91CD;&#x65B0;&#x6295;&#x5F71;&#x4E24;&#x4E2A;&#x56FE;&#x50CF;&#x3002; &#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x76F8;&#x5E94;&#x7684;&#x70B9;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;Y&#x5750;&#x6807;&#xFF0C;&#x5E76;&#x4E14;&#x4EC5;&#x901A;&#x8FC7;&#x6C34;&#x5E73;&#x5E73;&#x79FB;&#x8FDB;&#x884C;&#x5173;&#x8054;&#x3002;</p>
<p><img src="media/&#x7ACB;&#x4F53;&#x76F8;&#x673A;-4.png" alt=""></p>
<h4 id="&#x4E09;&#x3001;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x6807;&#x5B9A;&#x548C;&#x6821;&#x6B63;&#x7684;&#x6B65;&#x9AA4;">&#x4E09;&#x3001;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x6807;&#x5B9A;&#x548C;&#x6821;&#x6B63;&#x7684;&#x6B65;&#x9AA4;</h4>
<p>1.&#x4F7F;&#x7528;&#x76F8;&#x673A;&#x6821;&#x51C6;&#x624B;&#x518C;&#x4E2D;&#x4ECB;&#x7ECD;&#x7684;&#x6807;&#x51C6;OpenCV&#x6821;&#x51C6;&#x65B9;&#x6CD5;&#x6821;&#x51C6;&#x5355;&#x4E2A;&#x6444;&#x50CF;&#x673A;&#xFF1B;</p>
<p>2.&#x786E;&#x5B9A;&#x5728;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x4E24;&#x4E2A;&#x76F8;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x6362;&#x5173;&#x7CFB;&#x3002;</p>
<p>3.&#x4F7F;&#x7528;&#x524D;&#x9762;&#x6B65;&#x9AA4;&#x4E2D;&#x83B7;&#x5F97;&#x7684;&#x53C2;&#x6570;&#x548C;stereoCalibrate&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x786E;&#x5B9A;&#x5E94;&#x7528;&#x4E8E;&#x4E24;&#x4E2A;&#x56FE;&#x50CF;&#x7684;&#x53D8;&#x6362;&#x4EE5;&#x8FDB;&#x884C;&#x7ACB;&#x4F53;&#x6821;&#x6B63;&#x3002;</p>
<p>4.&#x6700;&#x540E;&#xFF0C;&#x4F7F;&#x7528;initUndistortRectifyMap&#x65B9;&#x6CD5;&#x83B7;&#x5F97;&#x67E5;&#x627E;&#x672A;&#x5931;&#x771F;&#x548C;&#x6821;&#x6B63;&#x540E;&#x7684;&#x7ACB;&#x4F53;&#x56FE;&#x50CF;&#x5BF9;&#x6240;&#x9700;&#x7684;&#x6620;&#x5C04;&#x3002;</p>
<p>5.&#x5C06;&#x6B64;&#x6620;&#x5C04;&#x5E94;&#x7528;&#x4E8E;&#x539F;&#x59CB;&#x56FE;&#x50CF;&#x4EE5;&#x83B7;&#x5F97;&#x6821;&#x6B63;&#x7684;&#x672A;&#x5931;&#x771F;&#x7684;&#x7ACB;&#x4F53;&#x56FE;&#x50CF;&#x5BF9;&#x3002;</p>
<p>1&#xFF09;&#x5DE6;&#x53F3;&#x76F8;&#x673A;&#x7684;&#x72EC;&#x7ACB;&#x6807;&#x5B9A;</p>
<p>&#x5728;&#x6267;&#x884C;&#x7ACB;&#x4F53;&#x6807;&#x5B9A;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5206;&#x522B;&#x5BF9;&#x4E24;&#x4E2A;&#x76F8;&#x673A;&#x8FDB;&#x884C;&#x6807;&#x5B9A;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;stereoCalibrate()&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5BF9;&#x4E24;&#x4E2A;&#x76F8;&#x673A;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x884C;&#x6821;&#x51C6;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x8981;&#x5206;&#x522B;&#x6807;&#x5B9A;&#x76F8;&#x673A;&#x5462;&#xFF1F;</p>
<p>&#x7531;&#x4E8E;&#x8981;&#x8BA1;&#x7B97;&#x7684;&#x53C2;&#x6570;&#x5F88;&#x591A;&#xFF08;&#x8F83;&#x5927;&#x7684;&#x53C2;&#x6570;&#x7A7A;&#x95F4;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x8BF8;&#x5982;&#x89D2;&#x70B9;&#x68C0;&#x6D4B;&#x548C;&#x5C06;&#x70B9;&#x8FD1;&#x4F3C;&#x4E3A;&#x6574;&#x6570;&#x4E4B;&#x7C7B;&#x7684;&#x6B65;&#x9AA4;&#x4E2D;&#x7D2F;&#x79EF;&#x4E86;&#x8BEF;&#x5DEE;&#x3002; &#x8FD9;&#x589E;&#x52A0;&#x4E86;&#x8FED;&#x4EE3;&#x65B9;&#x6CD5;&#x504F;&#x79BB;&#x6B63;&#x786E;&#x89E3;&#x7684;&#x98CE;&#x9669;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5206;&#x522B;&#x8BA1;&#x7B97;&#x6444;&#x50CF;&#x673A;&#x53C2;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;stereoCalibrate()&#x65B9;&#x6CD5;&#x4EC5;&#x7528;&#x4E8E;&#x83B7;&#x53D6;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#x5BF9;&#x95F4;&#x7684;&#x4F4D;&#x7F6E;&#x5173;&#x7CFB;&#xFF0C;&#x672C;&#x8D28;&#x77E9;&#x9635;&#x548C;&#x57FA;&#x7840;&#x77E9;&#x9635;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8BE5;&#x7B97;&#x6CD5;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x8981;&#x8DF3;&#x8FC7;&#x5355;&#x76F8;&#x673A;&#x7684;&#x6807;&#x5B9A;&#xFF1F; &#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x8BBE;&#x7F6E;&#x6807;&#x5FD7;CALIB_FIX_INTRINSIC&#x5E76;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;&#x8BE5;&#x65B9;&#x6CD5;&#x3002;</p>
<p>2&#xFF09;&#x7528;&#x56FA;&#x5B9A;&#x5185;&#x53C2;&#x6267;&#x884C;&#x7ACB;&#x4F53;&#x6807;&#x5B9A;</p>
<p>&#x6821;&#x51C6;&#x76F8;&#x673A;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5B83;&#x4EEC;&#x4F20;&#x9012;&#x7ED9;stereoCalibrate()&#x65B9;&#x6CD5;&#x5E76;&#x8BBE;&#x7F6E;CALIB_FIX_INTRINSIC&#x6807;&#x5FD7;&#x3002; &#x6211;&#x4EEC;&#x8FD8;&#x4F20;&#x9012;&#x4E24;&#x4E2A;&#x56FE;&#x50CF;&#x4E2D;&#x6355;&#x83B7;&#x7684;3D&#x70B9;&#x548C;&#x76F8;&#x5E94;&#x7684;2D&#x50CF;&#x7D20;&#x5750;&#x6807;&#x3002;</p>
<p>&#x8BE5;&#x65B9;&#x6CD5;&#x8BA1;&#x7B97;&#x76F8;&#x673A;&#x95F4;&#x7684;&#x5E73;&#x79FB;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x4EE5;&#x53CA;&#x57FA;&#x7840;&#x77E9;&#x9635;&#x548C;&#x672C;&#x8D28;&#x77E9;&#x9635;&#x3002;<img src="media/&#x7ACB;&#x4F53;&#x76F8;&#x673A;-5.png" alt=""></p>
<p>3&#xFF09;&#x7ACB;&#x4F53;&#x6821;&#x6B63;</p>
<p>&#x4F7F;&#x7528;&#x76F8;&#x673A;&#x7684;&#x5185;&#x5916;&#x53C2;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x8FD0;&#x7528;&#x7ACB;&#x4F53;&#x6821;&#x6B63;&#x4E86;&#x3002;&#x7ACB;&#x4F53;&#x6821;&#x6B63;&#x8FD0;&#x7528;&#x65CB;&#x8F6C;&#x4F7F;&#x4E24;&#x4E2A;&#x76F8;&#x673A;&#x56FE;&#x50CF;&#x9762;&#x90FD;&#x5728;&#x540C;&#x4E00;&#x5E73;&#x9762;&#x4E0A;&#xFF0C;&#x540C;&#x65F6;stereoRectify&#x65B9;&#x6CD5;&#x8FD8;&#x80FD;&#x8FD4;&#x56DE;&#x65B0;&#x5750;&#x6807;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x6295;&#x5F71;&#x77E9;&#x9635;&#x3002;<img src="media/&#x7ACB;&#x4F53;&#x76F8;&#x673A;-6.png" alt=""></p>
<p>4&#xFF09;&#x8BA1;&#x7B97;&#x6240;&#x9700;&#x7684;&#x6620;&#x5C04;</p>
<p>&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x76F8;&#x673A;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x65E0;&#x9700;&#x518D;&#x6B21;&#x8BA1;&#x7B97;&#x53D8;&#x6362;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;&#x7684;&#x901A;&#x8FC7;&#x6620;&#x5C04;&#x5C06;&#x7ACB;&#x4F53;&#x56FE;&#x50CF;&#x5BF9;&#x8F6C;&#x6362;&#x4E3A;&#x672A;&#x5931;&#x771F;&#x7684;&#x6821;&#x6B63;&#x7684;&#x7ACB;&#x4F53;&#x56FE;&#x50CF;&#x5BF9;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4FDD;&#x5B58;&#x4EE5;&#x5907;&#x5C06;&#x8FDB;&#x4E00;&#x6B65;&#x4F7F;&#x7528;&#x3002;</p>
<hr>
<p>&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x5236;&#x4F5C;&#x597D;&#x4E86;&#x7ACB;&#x4F53;&#x76F8;&#x673A;&#xFF0C;&#x4E0B;&#x671F;&#x518D;&#x4F1A;~</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="3D视觉工坊.html" class="navigation navigation-prev " aria-label="Previous page: 3D视觉工坊">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../古月居/古月居.html" class="navigation navigation-next " aria-label="Next page: 古月居">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"用OpenCV制作一个低成本的立体相机","level":"1.2.1","depth":2,"next":{"title":"古月居","level":"1.3","depth":1,"path":"古月居/古月居.md","ref":"古月居/古月居.md","articles":[{"title":"Vision","level":"1.3.1","depth":2,"ref":"","articles":[{"title":"相机投影模型","level":"1.3.1.1","depth":3,"ref":"","articles":[{"title":"相机投影模型之量身高","level":"1.3.1.1.1","depth":4,"path":"古月居/Vision/相机投影模型/相机投影模型之量身高.md","ref":"古月居/Vision/相机投影模型/相机投影模型之量身高.md","articles":[]}]}]}]},"previous":{"title":"3D视觉工坊","level":"1.2","depth":1,"path":"3D视觉工坊/3D视觉工坊.md","ref":"3D视觉工坊/3D视觉工坊.md","articles":[{"title":"用OpenCV制作一个低成本的立体相机","level":"1.2.1","depth":2,"path":"3D视觉工坊/用OpenCV制作一个低成本的立体相机.md","ref":"3D视觉工坊/用OpenCV制作一个低成本的立体相机.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["alerts","code","theme-comscore","back-to-top-button","expandable-chapters","etoc","mermaid","mermaid-gb3"],"pluginsConfig":{"etoc":{"h2lb":3,"header":1,"maxdepth":4,"mindepth":3,"notoc":false},"search":{},"mermaid":{},"lunr":{"maxIndexSize":200000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"mermaid-gb3":{},"theme-comscore":{},"back-to-top-button":{},"alerts":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":true},"expandable-chapters":{}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"3D视觉工坊/用OpenCV制作一个低成本的立体相机.md","mtime":"2021-03-19T06:22:18.392Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-19T08:19:47.230Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-alerts/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-etoc/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mermaid-gb3/book/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    <script src="../gitbook/gitbook-plugin-mermaid-gb3/mermaid/mermaid.min.js"></script>

    </body>
</html>

